function Task1
    % Ограниченията от задачата. х е между -3 и 3 като стъпката с която ще
    % се мени е 0.3. За у е еквивалентно.
    x = -3:0.3:3;
    y = -2:0.3:2;
    delta = 0.2;
    hold on;
    axis([-4,4,-3,3]);
    grid on;
    
    % След като сме задали ограниченията на задачата и сме начертали
    % квадрата ще начертаем полето от прави за даденото ни уравнение.
    for k=1:length(x)
        for m=1:length(y)
            eps = delta/sqrt(1+f(x(k), y(m))^2);
            plot([x(k)-eps, x(k)+eps],[y(m)-eps*f(x(k), y(m)), y(m)+eps*f(x(k), y(m))], 'b');
            plot(x(k), y(m), 'b.');
        end
    end
    
    % След като полето от прави е начертано, следващата стъпка е да вземем
    % х0 и у0 с клик и да начертаем приближението на функцията минаващо
    % през точката (х0, у0)
    [x0, y0] = ginput(1);
    plot(x0, y0, 'g*');
    
    % -y^2/2 + 4*x^2 = 2*C
    C = (4*x0^2 - y0^2 ) / 2; 
    
    if (C < 0)
        % Чертаем нормално приближение, което минава през точка (х0, у0)
        [X, Y]=ode45(@f, [x0, -3], y0);
        [X1, Y1]=ode45(@f, [x0, 3], y0);
        plot(X, Y, 'r');
        plot(X1, Y1, 'r');
    elseif(C > 0)
        % В този случай трябва да се начертае само 1 част от графиката, тъй
        % като за всеки х има по два у-ка.
        if(x0 < 0)
            % Ако y = 0 => x^2 = (2*C) / 4 => 
            % x = sqrt( (2*C) / 4).
            % Тъй като сме в случаят, когато С < 0, то ползваме функцията
            % abs(), която връша числото по модул, преди да извършим
            % коренуването. След това ползваме функцията ode45, за да
            % начертаем графиката на приближеното решение с х между -3 и
            % сметнатият х при у = 0; В този случай сме при х0 < 0 =>
            % получената нова граница трябва да е с минус.
            right_x = sqrt(abs(2*C / 4));
            [X, Y]=ode45(@f, [x0, -3], y0);
            [X1, Y1]=ode45(@f, [x0, -right_x], y0);
            plot(X, Y, 'r');
            plot(X1, Y1, 'r');
        elseif(x0 > 0)
            % Аналогично на горния случай, просто липсва минус на пред
            % новият х.
            left_x = sqrt(abs(2*C / 4));
            [X, Y]=ode45(@f, [x0, 3], y0);
            [X1, Y1]=ode45(@f, [x0, left_x], y0);
            plot(X, Y, 'r');
            plot(X1, Y1, 'r');  
        end
    end
    
    function z = f(x,y)
        z = 4*x/y;
    end

end
